real_world_exploration/state_of_rendering_031326/billSage_all_views_simple_recommended/billSage_structure.ui_contracts.recommended.dot
digraph ui_contracts {
  rankdir=LR;
  graph [fontname="Public Sans", compound=true, nodesep=0.7, ranksep=1.0];
  node [fontname="Public Sans"];
  edge [fontname="Public Sans"];
  subgraph cluster_P_100 {
    graph [label=<<TABLE BORDER="0" CELLBORDER="0" CELLPADDING="0"><TR><TD ALIGN="LEFT">Dashboard</TD></TR><TR><TD ALIGN="LEFT">/dashboard</TD></TR><TR><TD ALIGN="LEFT">[auth]</TD></TR></TABLE>>, style="rounded", labelloc="t", labeljust="l"];
    "P-100__anchor" [label="", shape="point", width=0, height=0, style="invis"];
    "C-900" [shape="box", style="rounded", label="Global Navigation"];
  }
  subgraph cluster_P_110 {
    graph [label=<<TABLE BORDER="0" CELLBORDER="0" CELLPADDING="0"><TR><TD ALIGN="LEFT">Report View</TD></TR><TR><TD ALIGN="LEFT">/dashboard/report-view</TD></TR><TR><TD ALIGN="LEFT">[auth]</TD></TR></TABLE>>, style="rounded", labelloc="t", labeljust="l"];
    "P-110__anchor" [label="", shape="point", width=0, height=0, style="invis"];
  }
  subgraph cluster_P_210 {
    graph [label=<<TABLE BORDER="0" CELLBORDER="0" CELLPADDING="0"><TR><TD ALIGN="LEFT">Projections Overview</TD></TR><TR><TD ALIGN="LEFT">/projections</TD></TR><TR><TD ALIGN="LEFT">[auth]</TD></TR></TABLE>>, style="rounded", labelloc="t", labeljust="l"];
    "P-210__anchor" [label="", shape="point", width=0, height=0, style="invis"];
    "VS-210a" [shape="box", style="rounded,dashed", label="Projection List\ndata: ProjectionCollection"];
    "VS-210b" [shape="box", style="rounded,dashed", label="Duplicate Projection Dialog\ndata: SelectedProjection"];
    "VS-210c" [shape="box", style="rounded,dashed", label="Delete Projection Confirmation Dialog\ndata: SelectedProjection"];
    "VS-210d" [shape="box", style="rounded,dashed", label="Add Projection to Dashboard Confirmation Dialog\ndata: SelectedProjection"];
    "C-900" [shape="box", style="rounded", label="Global Navigation"];
  }
  subgraph cluster_P_220 {
    graph [label=<<TABLE BORDER="0" CELLBORDER="0" CELLPADDING="0"><TR><TD ALIGN="LEFT">Projection</TD></TR><TR><TD ALIGN="LEFT">/projections/projection</TD></TR><TR><TD ALIGN="LEFT">[auth]</TD></TR></TABLE>>, style="rounded", labelloc="t", labeljust="l"];
    "P-220__anchor" [label="", shape="point", width=0, height=0, style="invis"];
    "VS-220a" [shape="box", style="rounded,dashed", label="Overview Tab\ndata: ProjectionOverview"];
    "VS-220b" [shape="box", style="rounded,dashed", label="Fee Schedules Tab\ndata: FeeScheduleScenario"];
    "VS-220c" [shape="box", style="rounded,dashed", label="Funds Tab\ndata: FundingScenario"];
  }
  subgraph cluster_P_221 {
    graph [label=<<TABLE BORDER="0" CELLBORDER="0" CELLPADDING="0"><TR><TD ALIGN="LEFT">Fee Schedule Scenario Details</TD></TR><TR><TD ALIGN="LEFT">/projections/projection/fee-schedule-scenario-details</TD></TR><TR><TD ALIGN="LEFT">[auth]</TD></TR></TABLE>>, style="rounded", labelloc="t", labeljust="l"];
    "P-221__anchor" [label="", shape="point", width=0, height=0, style="invis"];
  }
  subgraph cluster_P_222 {
    graph [label=<<TABLE BORDER="0" CELLBORDER="0" CELLPADDING="0"><TR><TD ALIGN="LEFT">Funding Scenario Details</TD></TR><TR><TD ALIGN="LEFT">/projections/projection/funding-scenario-details</TD></TR><TR><TD ALIGN="LEFT">[auth]</TD></TR></TABLE>>, style="rounded", labelloc="t", labeljust="l"];
    "P-222__anchor" [label="", shape="point", width=0, height=0, style="invis"];
  }
  subgraph cluster_P_230 {
    graph [label=<<TABLE BORDER="0" CELLBORDER="0" CELLPADDING="0"><TR><TD ALIGN="LEFT">Create New Projection</TD></TR><TR><TD ALIGN="LEFT">/projections/create-new-projection</TD></TR><TR><TD ALIGN="LEFT">[auth]</TD></TR></TABLE>>, style="rounded", labelloc="t", labeljust="l"];
    "P-230__anchor" [label="", shape="point", width=0, height=0, style="invis"];
    "VS-230a" [shape="box", style="rounded,dashed", label="Create New Projection Step 1\ndata: ProjectionBasics"];
    "VS-230b" [shape="box", style="rounded,dashed", label="Create New Projection Step 2\ndata: FeeScheduleSelection"];
    "VS-230c" [shape="box", style="rounded,dashed", label="Create New Projection Step 3\ndata: FundingScenarioSelection"];
  }
  subgraph cluster_P_310 {
    graph [label=<<TABLE BORDER="0" CELLBORDER="0" CELLPADDING="0"><TR><TD ALIGN="LEFT">Current Bills</TD></TR><TR><TD ALIGN="LEFT">/current-bills</TD></TR><TR><TD ALIGN="LEFT">[auth]</TD></TR></TABLE>>, style="rounded", labelloc="t", labeljust="l"];
    "P-310__anchor" [label="", shape="point", width=0, height=0, style="invis"];
    "C-900" [shape="box", style="rounded", label="Global Navigation"];
  }
  subgraph cluster_P_410 {
    graph [label=<<TABLE BORDER="0" CELLBORDER="0" CELLPADDING="0"><TR><TD ALIGN="LEFT">Review Past Bills</TD></TR><TR><TD ALIGN="LEFT">/review</TD></TR><TR><TD ALIGN="LEFT">[auth]</TD></TR></TABLE>>, style="rounded", labelloc="t", labeljust="l"];
    "P-410__anchor" [label="", shape="point", width=0, height=0, style="invis"];
    "C-900" [shape="box", style="rounded", label="Global Navigation"];
  }
  subgraph cluster_P_510 {
    graph [label=<<TABLE BORDER="0" CELLBORDER="0" CELLPADDING="0"><TR><TD ALIGN="LEFT">Manage Accounts</TD></TR><TR><TD ALIGN="LEFT">/accounts</TD></TR><TR><TD ALIGN="LEFT">[auth]</TD></TR></TABLE>>, style="rounded", labelloc="t", labeljust="l"];
    "P-510__anchor" [label="", shape="point", width=0, height=0, style="invis"];
    "C-900" [shape="box", style="rounded", label="Global Navigation"];
  }
  subgraph cluster_P_610 {
    graph [label=<<TABLE BORDER="0" CELLBORDER="0" CELLPADDING="0"><TR><TD ALIGN="LEFT">Manage Fee Schedules</TD></TR><TR><TD ALIGN="LEFT">/fee-schedules</TD></TR><TR><TD ALIGN="LEFT">[auth]</TD></TR></TABLE>>, style="rounded", labelloc="t", labeljust="l"];
    "P-610__anchor" [label="", shape="point", width=0, height=0, style="invis"];
    "C-900" [shape="box", style="rounded", label="Global Navigation"];
  }
  "P-100__anchor" -> "P-110__anchor" [style=invis, weight=100];
  "P-110__anchor" -> "P-210__anchor" [style=invis, weight=100];
  "P-210__anchor" -> "P-220__anchor" [style=invis, weight=100];
  "P-220__anchor" -> "P-221__anchor" [style=invis, weight=100];
  "P-221__anchor" -> "P-222__anchor" [style=invis, weight=100];
  "P-222__anchor" -> "P-230__anchor" [style=invis, weight=100];
  "P-230__anchor" -> "P-310__anchor" [style=invis, weight=100];
  "P-310__anchor" -> "P-410__anchor" [style=invis, weight=100];
  "P-410__anchor" -> "P-510__anchor" [style=invis, weight=100];
  "P-510__anchor" -> "P-610__anchor" [style=invis, weight=100];
  "P-100__anchor" -> "C-900" [style=invis, weight=100];
  "P-210__anchor" -> "VS-210a" [style=invis, weight=100];
  "VS-210a" -> "VS-210b" [style=invis, weight=100];
  "VS-210b" -> "VS-210c" [style=invis, weight=100];
  "VS-210c" -> "VS-210d" [style=invis, weight=100];
  "VS-210d" -> "C-900" [style=invis, weight=100];
  "P-220__anchor" -> "VS-220a" [style=invis, weight=100];
  "VS-220a" -> "VS-220b" [style=invis, weight=100];
  "VS-220b" -> "VS-220c" [style=invis, weight=100];
  "P-230__anchor" -> "VS-230a" [style=invis, weight=100];
  "P-310__anchor" -> "C-900" [style=invis, weight=100];
  "P-410__anchor" -> "C-900" [style=invis, weight=100];
  "P-510__anchor" -> "C-900" [style=invis, weight=100];
  "P-610__anchor" -> "C-900" [style=invis, weight=100];
  "VS-230a" -> "VS-230b" [style="solid", weight=4];
  "VS-230b" -> "VS-230c" [style="solid", weight=4];
}
